test/artillery/client.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 200
      rampTo: 400
      name: Spike phase
scenarios:
  - flow:
      - log: "get all clients"
      - get:
          url: "/v1/client"
      - log: "get client with id=1"
      - get: 
          url: "/v1/client/1"
      - log: "get all containers from client with id=1"
      - get: 
          url: "/v1/client/1/containers"