test/artillery/register.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 200
      rampTo: 400
      name: Spike phase
scenarios:
  - flow:
      - log: "get all the registers from the skip=0 to limit=1000"
      - get:
          url: "/v1/register?skip=0&limit=1000"
      - log: "get the register wiht id=92"
      - get:
          url: "/v1/register/92"
      - log: "get the registers from the UI"
      - get:
          url: "/ui/v1/registers"